rkz/extension/Documents/ЗаказНаПроизводство2_2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказНаПроизводство2_2</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Приоритеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипПроизводственногоПроцесса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПроизводственныхПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказовНаПроизводство2_2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаПотребности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НачатьНеРанее</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ПереданВПроизводство</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Продукция</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДоляСтоимости</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Отменено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПричинаОтмены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПричиныОтменыПроизводства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>АналитикаАктивовПассивов</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.СтатьиАктивовПассивов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Спецификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РесурсныеСпецификации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДоляСтоимостиНаЕдиницу</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СписатьНаРасходы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>АналитикаРасходов</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КлючНоменклатура</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

rkz/extension/Documents/ЗаказНаПроизводство2_2/Forms/бит_ФормаСписка/Ext/Form/Module.bsl
&НаСервере
&После("ПриСозданииНаСервере")
Процедура бит_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] +  

	//Только суточный пакет
	ДобавляемыеРеквизиты = Новый Массив; 
	НовыйРеквизит = Новый РеквизитФормы("бит_ТолькоСуточныйПакет", Новый ОписаниеТипов("Булево")); 
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);	
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты); 
	
	ЭтотОбъект.бит_ТолькоСуточныйПакет = ИСТИНА;
		
	НовыйЭлемент = Этаформа.Элементы.Вставить("бит_ТолькоСуточныйПакет", Тип("ПолеФормы"), Элементы.ГруппаОтбор);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "бит_ТолькоСуточныйПакет";
	НовыйЭлемент.Заголовок = "(бит) Только суточный пакет"; 
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх; 
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "бит_ТолькоСуточныйПакетПриИзменении");
	
	//Пакет заказов
	НоваяКоманда = ЭтаФорма.Команды.Добавить("бит_ПакетЗаказов");
	НоваяКоманда.Заголовок = "(бит) Пакет заказов";
	НоваяКоманда.Действие = "бит_ПакетЗаказов"; 
	НоваяКоманда.Отображение = ОтображениеКнопки.КартинкаИТекст;
	НоваяКоманда.Картинка = БиблиотекаКартинок.ПоказатьВСписке;
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("бит_ПакетЗаказов", Тип("КнопкаФормы"),Элементы.КоманднаяПанельФорма);
	НовыйЭлемент.Заголовок = "(бит) Пакет заказов";
	НовыйЭлемент.ИмяКоманды = "бит_ПакетЗаказов";
	
	//Создать
	НоваяКоманда = ЭтаФорма.Команды.Добавить("бит_СоздатьЗаказНаПроизводство");
	НоваяКоманда.Заголовок = "Добавить";
	НоваяКоманда.Действие = "бит_СоздатьЗаказНаПроизводство"; 
	НоваяКоманда.Отображение = ОтображениеКнопки.КартинкаИТекст;
	НоваяКоманда.Картинка = БиблиотекаКартинок.СоздатьЭлементСписка;
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("бит_СоздатьЗаказНаПроизводство", Тип("КнопкаФормы"),Элементы.СписокГруппаСоздать);
	НовыйЭлемент.Заголовок = "Новый";
	НовыйЭлемент.ИмяКоманды = "бит_СоздатьЗаказНаПроизводство"; 
	
	НоваяКомандаКонтМеню = Элементы.Добавить("бит_СоздатьКонтМеню", Тип("КнопкаФормы"), Элементы.Список.КонтекстноеМеню);	
	НоваяКомандаКонтМеню.ИмяКоманды = "бит_СоздатьЗаказНаПроизводство";
	
	//Создать копированием
	НоваяКоманда = ЭтаФорма.Команды.Добавить("бит_СоздатьКопированиемЗаказНаПроизводство");
	НоваяКоманда.Заголовок = "Скопировать";
	НоваяКоманда.Действие = "бит_СоздатьКопированиемЗаказНаПроизводство"; 
	НоваяКоманда.Отображение = ОтображениеКнопки.Картинка;
	НоваяКоманда.Картинка = БиблиотекаКартинок.СкопироватьОбъект;
		
	НовыйЭлемент = ЭтаФорма.Элементы.Вставить("бит_СоздатьКопированиемЗаказНаПроизводство", Тип("КнопкаФормы"),Элементы.СписокКоманднаяПанель, Элементы.СписокСкопировать);
	НовыйЭлемент.Заголовок = "Скопировать";
	НовыйЭлемент.ИмяКоманды = "бит_СоздатьКопированиемЗаказНаПроизводство";
	
	НоваяКомандаКонтМеню = Элементы.Добавить("бит_СоздатьКопированиемКонтМеню", Тип("КнопкаФормы"), Элементы.Список.КонтекстноеМеню);
	НоваяКомандаКонтМеню.ИмяКоманды = "бит_СоздатьКопированиемЗаказНаПроизводство";   
	
	//Пометить на удаление
	НоваяКоманда = ЭтаФорма.Команды.Добавить("бит_ПометитьНаУдаление");
	НоваяКоманда.Заголовок = "Пометить на удаление";
	НоваяКоманда.Действие = "бит_ПометитьНаУдаление"; 
	НоваяКоманда.Отображение = ОтображениеКнопки.КартинкаИТекст;
	НоваяКоманда.Картинка = БиблиотекаКартинок.ПометитьНаУдаление;
	
	НовыйЭлемент = ЭтаФорма.Элементы.Вставить("бит_ПометитьНаУдаление", Тип("КнопкаФормы"),Элементы.СписокКоманднаяПанель, Элементы.СписокСкопировать);
	НовыйЭлемент.Заголовок = "Пометить на удаление";
	НовыйЭлемент.ИмяКоманды = "бит_ПометитьНаУдаление"; 
	НовыйЭлемент.ТолькоВоВсехДействиях  = ИСТИНА;
	
	НоваяКомандаКонтМеню = Элементы.Добавить("бит_ПометитьНаУдалениеКонтМеню", Тип("КнопкаФормы"), Элементы.Список.КонтекстноеМеню);
	НоваяКомандаКонтМеню.ИмяКоманды = "бит_ПометитьНаУдаление";
	
	//Провести
	НоваяКоманда = ЭтаФорма.Команды.Добавить("бит_ПровестиДокумент");
	НоваяКоманда.Заголовок = "Провести";
	НоваяКоманда.Действие = "бит_ПровестиДокумент"; 
	НоваяКоманда.Отображение = ОтображениеКнопки.КартинкаИТекст;
	НоваяКоманда.Картинка = БиблиотекаКартинок.Провести;
	
	НовыйЭлемент = ЭтаФорма.Элементы.Вставить("бит_ПровестиДокумент", Тип("КнопкаФормы"),Элементы.СписокКоманднаяПанель, Элементы.СписокСкопировать);
	НовыйЭлемент.Заголовок = "Провести";
	НовыйЭлемент.ИмяКоманды = "бит_ПровестиДокумент";
	НовыйЭлемент.ТолькоВоВсехДействиях  = ИСТИНА;
	
	НоваяКомандаКонтМеню = Элементы.Добавить("бит_ПровестиДокументКонтМеню", Тип("КнопкаФормы"), Элементы.Список.КонтекстноеМеню);
	НоваяКомандаКонтМеню.ИмяКоманды = "бит_ПровестиДокумент";
	
	//Отмена проведения
	НоваяКоманда = ЭтаФорма.Команды.Добавить("бит_ОтменитьПроведение");
	НоваяКоманда.Заголовок = "Отменить проведение";
	НоваяКоманда.Действие = "бит_ОтменитьПроведение"; 
	НоваяКоманда.Отображение = ОтображениеКнопки.КартинкаИТекст;
	НоваяКоманда.Картинка = БиблиотекаКартинок.ОтменаПроведения;
	
	НовыйЭлемент = ЭтаФорма.Элементы.Вставить("бит_ОтменитьПроведение", Тип("КнопкаФормы"),Элементы.СписокКоманднаяПанель, Элементы.СписокСкопировать);
	НовыйЭлемент.Заголовок = "Отменить проведение";
	НовыйЭлемент.ИмяКоманды = "бит_ОтменитьПроведение";
	НовыйЭлемент.ТолькоВоВсехДействиях  = ИСТИНА;
	
	НоваяКомандаКонтМеню = Элементы.Добавить("бит_ОтменитьПроведениеКонтМеню", Тип("КнопкаФормы"), Элементы.Список.КонтекстноеМеню);
	НоваяКомандаКонтМеню.ИмяКоманды = "бит_ОтменитьПроведение";
	
	//Динамический список
	Список.ОсновнаяТаблица = "";
	Список.ВидКлюча = ВидКлючаДинамическогоСписка.НомерСтроки;
	//Метод поиска родителей взят с портала итс https://its.1c.ru/db/metod8dev/content/2659/hdoc
	Список.ТекстЗапроса = ("
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИСТИНА КАК НеВключатьВСуточныйПакет,
		|	Номенклатура.Ссылка КАК Номенклатура
		|ПОМЕСТИТЬ вт_НоменклатураНеВСуточномПакете
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_НеВключатьВСуточныйПакет КАК бит_НеВключатьВСуточныйПакет
		|		ПО (Номенклатура.Родитель = бит_НеВключатьВСуточныйПакет.бит_ГруппаНоменклатуры
		|				ИЛИ Номенклатура.Родитель.Родитель = бит_НеВключатьВСуточныйПакет.бит_ГруппаНоменклатуры
		|				ИЛИ Номенклатура.Родитель.Родитель.Родитель = бит_НеВключатьВСуточныйПакет.бит_ГруппаНоменклатуры
		|				ИЛИ Номенклатура.Родитель.Родитель.Родитель.Родитель = бит_НеВключатьВСуточныйПакет.бит_ГруппаНоменклатуры)
		|ГДЕ
		|	НЕ бит_НеВключатьВСуточныйПакет.ПометкаУдаления
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказНаПроизводство.Номер КАК Номер,
		|	ЗаказНаПроизводство.Дата КАК Дата,
		|	ЗаказНаПроизводство.Статус КАК Статус,
		|	ЗаказНаПроизводство.ТипПроизводственногоПроцесса КАК ТипПроизводственногоПроцесса,
		|	-ЗаказНаПроизводство.Приоритет.РеквизитДопУпорядочивания КАК ПриоритетНомер,
		|	ЗаказНаПроизводство.Приоритет КАК Приоритет,
		|	ЗаказНаПроизводство.НачатьНеРанее КАК НачалоПроизводства,
		|	ЗаказНаПроизводство.ДатаПотребности КАК ДатаПотребности,
		|	ЗаказНаПроизводство.Подразделение КАК Подразделение,
		|	ЗаказНаПроизводство.Ответственный КАК Ответственный,
		|	ЗаказНаПроизводство.Комментарий КАК Комментарий,
		|	ЗаказНаПроизводство.Ссылка КАК Ссылка,
		|	ЗаказНаПроизводство2_2Продукция.Номенклатура КАК Номенклатура,
		|	ЗаказНаПроизводство2_2Продукция.Количество КАК Количество
		|ИЗ
		|	Документ.ЗаказНаПроизводство2_2 КАК ЗаказНаПроизводство
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаПроизводство2_2.Продукция КАК ЗаказНаПроизводство2_2Продукция
		|			ЛЕВОЕ СОЕДИНЕНИЕ вт_НоменклатураНеВСуточномПакете КАК вт_НоменклатураНеВСуточномПакете
		|			ПО (вт_НоменклатураНеВСуточномПакете.Номенклатура = ЗаказНаПроизводство2_2Продукция.Номенклатура)
		|		ПО (ЗаказНаПроизводство2_2Продукция.Ссылка = ЗаказНаПроизводство.Ссылка)
		|ГДЕ
		|	ЕСТЬNULL(вт_НоменклатураНеВСуточномПакете.НеВключатьВСуточныйПакет, 0) = 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка");

// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] -  

КонецПроцедуры  

&НаКлиенте
Процедура бит_ПакетЗаказов(Команда)  
	
// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] +  
	ОткрытьФорму("Документ.ЗаказНаПроизводство2_2.Форма.бит_ФормаПакетЗаказов",,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] -
	
КонецПроцедуры 

 &НаКлиенте
Процедура бит_ТолькоСуточныйПакетПриИзменении(Команда)  
	
// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] + 
	бит_ТолькоСуточныйПакетПриИзмененииНаСервере();
// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] -
	
КонецПроцедуры 

&НаСервере
Процедура бит_ТолькоСуточныйПакетПриИзмененииНаСервере()  
	
// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] + 
	
	//Метод поиска родителей взят с портала итс https://its.1c.ru/db/metod8dev/content/2659/hdoc
	Если ЭтотОбъект.бит_ТолькоСуточныйПакет Тогда
		Список.ТекстЗапроса = ("
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИСТИНА КАК НеВключатьВСуточныйПакет,
		|	Номенклатура.Ссылка КАК Номенклатура
		|ПОМЕСТИТЬ вт_НоменклатураНеВСуточномПакете
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_НеВключатьВСуточныйПакет КАК бит_НеВключатьВСуточныйПакет
		|		ПО (Номенклатура.Родитель = бит_НеВключатьВСуточныйПакет.бит_ГруппаНоменклатуры
		|				ИЛИ Номенклатура.Родитель.Родитель = бит_НеВключатьВСуточныйПакет.бит_ГруппаНоменклатуры
		|				ИЛИ Номенклатура.Родитель.Родитель.Родитель = бит_НеВключатьВСуточныйПакет.бит_ГруппаНоменклатуры
		|				ИЛИ Номенклатура.Родитель.Родитель.Родитель.Родитель = бит_НеВключатьВСуточныйПакет.бит_ГруппаНоменклатуры)
		|ГДЕ
		|	НЕ бит_НеВключатьВСуточныйПакет.ПометкаУдаления
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказНаПроизводство.Номер КАК Номер,
		|	ЗаказНаПроизводство.Дата КАК Дата,
		|	ЗаказНаПроизводство.Статус КАК Статус,
		|	ЗаказНаПроизводство.ТипПроизводственногоПроцесса КАК ТипПроизводственногоПроцесса,
		|	-ЗаказНаПроизводство.Приоритет.РеквизитДопУпорядочивания КАК ПриоритетНомер,
		|	ЗаказНаПроизводство.Приоритет КАК Приоритет,
		|	ЗаказНаПроизводство.НачатьНеРанее КАК НачалоПроизводства,
		|	ЗаказНаПроизводство.ДатаПотребности КАК ДатаПотребности,
		|	ЗаказНаПроизводство.Подразделение КАК Подразделение,
		|	ЗаказНаПроизводство.Ответственный КАК Ответственный,
		|	ЗаказНаПроизводство.Комментарий КАК Комментарий,
		|	ЗаказНаПроизводство.Ссылка КАК Ссылка,
		|	ЗаказНаПроизводство2_2Продукция.Номенклатура КАК Номенклатура,
		|	ЗаказНаПроизводство2_2Продукция.Количество КАК Количество
		|ИЗ
		|	Документ.ЗаказНаПроизводство2_2 КАК ЗаказНаПроизводство
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаПроизводство2_2.Продукция КАК ЗаказНаПроизводство2_2Продукция
		|			ЛЕВОЕ СОЕДИНЕНИЕ вт_НоменклатураНеВСуточномПакете КАК вт_НоменклатураНеВСуточномПакете
		|			ПО (вт_НоменклатураНеВСуточномПакете.Номенклатура = ЗаказНаПроизводство2_2Продукция.Номенклатура)
		|		ПО (ЗаказНаПроизводство2_2Продукция.Ссылка = ЗаказНаПроизводство.Ссылка)
		|ГДЕ
		|	ЕСТЬNULL(вт_НоменклатураНеВСуточномПакете.НеВключатьВСуточныйПакет, 0) = 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка");
	Иначе
		Список.ТекстЗапроса = ("
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаказНаПроизводство2_2Продукция.Ссылка КАК Ссылка,
		|	ЗаказНаПроизводство2_2Продукция.Номенклатура КАК Номенклатура,
		|	ЗаказНаПроизводство2_2Продукция.Количество КАК Количество
		|ПОМЕСТИТЬ вт_ЗаказыВключаютСуточныйПакет
		|ИЗ
		|	Документ.ЗаказНаПроизводство2_2.Продукция КАК ЗаказНаПроизводство2_2Продукция
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бит_НеВключатьВСуточныйПакет КАК бит_НеВключатьВСуточныйПакет
		|		ПО (ЗаказНаПроизводство2_2Продукция.Номенклатура.Родитель = бит_НеВключатьВСуточныйПакет.бит_ГруппаНоменклатуры
		|				ИЛИ ЗаказНаПроизводство2_2Продукция.Номенклатура.Родитель.Родитель = бит_НеВключатьВСуточныйПакет.бит_ГруппаНоменклатуры
		|				ИЛИ ЗаказНаПроизводство2_2Продукция.Номенклатура.Родитель.Родитель.Родитель = бит_НеВключатьВСуточныйПакет.бит_ГруппаНоменклатуры
		|				ИЛИ ЗаказНаПроизводство2_2Продукция.Номенклатура.Родитель.Родитель.Родитель.Родитель = бит_НеВключатьВСуточныйПакет.бит_ГруппаНоменклатуры)
		|ГДЕ
		|	НЕ бит_НеВключатьВСуточныйПакет.ПометкаУдаления
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказНаПроизводство.Номер КАК Номер,
		|	ЗаказНаПроизводство.Дата КАК Дата,
		|	ЗаказНаПроизводство.Статус КАК Статус,
		|	ЗаказНаПроизводство.ТипПроизводственногоПроцесса КАК ТипПроизводственногоПроцесса,
		|	-ЗаказНаПроизводство.Приоритет.РеквизитДопУпорядочивания КАК ПриоритетНомер,
		|	ЗаказНаПроизводство.Приоритет КАК Приоритет,
		|	ЗаказНаПроизводство.НачатьНеРанее КАК НачалоПроизводства,
		|	ЗаказНаПроизводство.ДатаПотребности КАК ДатаПотребности,
		|	ЗаказНаПроизводство.Подразделение КАК Подразделение,
		|	ЗаказНаПроизводство.Ответственный КАК Ответственный,
		|	ЗаказНаПроизводство.Комментарий КАК Комментарий,
		|	ЗаказНаПроизводство.Ссылка КАК Ссылка,
		|	вт_ЗаказыВключаютСуточныйПакет.Номенклатура КАК Номенклатура,
		|	вт_ЗаказыВключаютСуточныйПакет.Количество КАК Количество
		|ИЗ
		|	вт_ЗаказыВключаютСуточныйПакет КАК вт_ЗаказыВключаютСуточныйПакет
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаПроизводство2_2 КАК ЗаказНаПроизводство
		|		ПО (вт_ЗаказыВключаютСуточныйПакет.Ссылка = ЗаказНаПроизводство.Ссылка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка");
	КонецЕсли;
	
// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] -
	
КонецПроцедуры

#Область СтандартныеПроцедуры
&НаКлиенте
Процедура бит_СписокВыборПосле(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	
// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] +
	ПоказатьЗначение(,Элемент.ТекущиеДанные.Ссылка); 
// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] -

КонецПроцедуры

&НаКлиенте 
Процедура бит_СоздатьЗаказНаПроизводство()

// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] +  
	ОткрытьФорму("Документ.ЗаказНаПроизводство2_2.Форма.ФормаДокумента",,,,,,,);
// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] -
	
КонецПроцедуры

&НаКлиенте 
Процедура бит_СоздатьКопированиемЗаказНаПроизводство() 

// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] +
	ТекущийЭлемент = ЭтотОбъект.ТекущийЭлемент;
	
	Попытка
		Ссылка = ТекущийЭлемент.ТекущиеДанные.Ссылка; 	
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЗначениеКопирования", Ссылка);
		
		ОткрытьФорму("Документ.ЗаказНаПроизводство2_2.ФормаОбъекта", ПараметрыФормы );	
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Выберите документ для копирования!";
		Сообщение.Сообщить();
	КонецПопытки;
// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] -
	
КонецПроцедуры 

&НаКлиенте 
Процедура бит_ПометитьНаУдаление() 

// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] +
	ТекущийЭлемент = ЭтотОбъект.ТекущийЭлемент;
	
	Попытка
		Ссылка = ТекущийЭлемент.ТекущиеДанные.Ссылка; 
		бит_ПометитьНаУдалениеНаСервере(Ссылка);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Выберите документ для пометки на удаление!";
		Сообщение.Сообщить();
	КонецПопытки;
// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] -
	
КонецПроцедуры

&НаСервере
Процедура бит_ПометитьНаУдалениеНаСервере(Ссылка)

// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] +
	Если НЕ Ссылка.ПометкаУдаления Тогда 
		ДокОбъект = Ссылка.ПолучитьОбъект();
		ДокОбъект.УстановитьПометкуУдаления(ИСТИНА);
	Иначе
		ДокОбъект = Ссылка.ПолучитьОбъект();
		ДокОбъект.УстановитьПометкуУдаления(ЛОЖЬ);
	КонецЕсли;
// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] -

КонецПроцедуры

&НаКлиенте 
Процедура бит_ПровестиДокумент() 

// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] +
	ТекущийЭлемент = ЭтотОбъект.ТекущийЭлемент;
	
	Попытка
		Ссылка = ТекущийЭлемент.ТекущиеДанные.Ссылка; 
		бит_ПровестиДокументНаСервере(Ссылка);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Выберите документ для проведения!";
		Сообщение.Сообщить();
	КонецПопытки;
// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] -

КонецПроцедуры

&НаСервере
Процедура бит_ПровестиДокументНаСервере(Ссылка)

// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] +
	ДокОбъект = Ссылка.ПолучитьОбъект();
	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] -

КонецПроцедуры

&НаКлиенте 
Процедура бит_ОтменитьПроведение() 

// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] +
	ТекущийЭлемент = ЭтотОбъект.ТекущийЭлемент;
	
	Попытка
		Ссылка = ТекущийЭлемент.ТекущиеДанные.Ссылка; 
		бит_ОтменитьПроведениеНаСервере(Ссылка);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Выберите документ для отмены проведения!";
		Сообщение.Сообщить();
	КонецПопытки;
// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] -

КонецПроцедуры

&НаСервере
Процедура бит_ОтменитьПроведениеНаСервере(Ссылка)

// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] +
	ДокОбъект = Ссылка.ПолучитьОбъект();
	ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] -

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ИзменитьВыделенные")
Процедура бит_ИзменитьВыделенные(Команда)
	
	#Удаление // ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] +
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список.ВыделенныеСтроки);
	#КонецУдаления
	#Вставка   	 
	МассивВыделенныхДанных = Новый Массив(); 
	
	Для Каждого Строка из Элементы.Список.ВыделенныеСтроки Цикл
		МассивВыделенныхДанных.Добавить(Элементы.Список.ДанныеСтроки(Строка).Ссылка);
	КонецЦикла;
	
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(МассивВыделенныхДанных);		
	#КонецВставки // ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] -

КонецПроцедуры


&НаКлиенте
&ИзменениеИКонтроль("ВыбранныеЗаказы")
Функция бит_ВыбранныеЗаказы()  
	
    #Удаление // ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [01.10.2025] +
	Возврат ОбщегоНазначенияУТКлиент.ПроверитьПолучитьВыделенныеВСпискеСсылки(Элементы.Список);
	#КонецУдаления
	#Вставка   	 
	МассивВыделенныхДанных = Новый Массив(); 
	
	Для Каждого Строка из Элементы.Список.ВыделенныеСтроки Цикл
		МассивВыделенныхДанных.Добавить(Элементы.Список.ДанныеСтроки(Строка).Ссылка);
	КонецЦикла;
	
	Возврат МассивВыделенныхДанных;		
	#КонецВставки // ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [01.10.2025] -

КонецФункции
#КонецОбласти
